programa/index.html

<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>Programa - Curso de Computación</title>
  <meta name="author" content="Marduk Bolaños">

  
  <meta name="description" content="Programa Temario Introducción a la computación Breve historia de las computadoras Ejemplos de uso de las computadoras en la ciencia Descripción de &hellip;">
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  
  <link rel="canonical" href="http://computacion-marduk.github.com/programa/">
  <link href="/favicon.png" rel="icon">
  <link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">

 <link href="/atom.xml" rel="alternate" title="Curso de Computación" type="application/atom+xml">
  <!--Fonts from Google"s Web font directory at http://google.com/webfonts -->
<link href="http://fonts.googleapis.com/css?family=PT+Serif:regular,italic,bold,bolditalic" rel="stylesheet" type="text/css">
<link href="http://fonts.googleapis.com/css?family=PT+Sans:regular,italic,bold,bolditalic" rel="stylesheet" type="text/css">


  

</head>

<body   >
  <header role="banner"><hgroup>
  <h1><a href="/">Curso de Computación</a></h1>
  
    <h2>Facultad de Ciencias, UNAM</h2>
  
</hgroup>

</header>
  <nav role="navigation"><ul class="subscription" data-subscription="rss">
  <li><a href="/atom.xml" rel="subscribe-rss" title="subscribe via RSS">RSS</a></li>
  
</ul>
  
<form action="http://google.com/search" method="get">
  <fieldset role="search">
    <input type="hidden" name="q" value="site:computacion-marduk.github.com" />
    <input class="search" type="text" name="q" results="0" placeholder="Buscar"/>
  </fieldset>
</form>
  
<ul class="main-navigation">
<!--  <li><a href="/">Bitácora</a></li>-->
  <li><a href="/presentacion">Presentación</a></li>
  <li><a href="/programa">Programa</a></li>
  <li><a href="/tareas">Tareas</a></li>
  <li><a href="/linux">Linux</a></li>
  <li><a href="/recursos">Recursos</a></li>
<li><a href="/contacto">Contacto</a></li>
  <li><a href="/blog/archives">Archivo</a></li>
</ul>

</nav>
  <div id="main">
    <div id="content">
      <div>
<article role="article">
  
  <header>
    <h1 class="entry-title">Programa</h1>
    
  </header>
  
  <div id="outline-container-1" class="outline-4">
<h4 id="sec-1">Temario</h4>
<div class="outline-text-4" id="text-1">


<ol>
<li>Introducción a la computación 
<ol>
<li>Breve historia de las computadoras
</li>
<li>Ejemplos de uso de las computadoras en la ciencia
</li>
<li>Descripción de los elementos del <i>hardware</i>
</li>
<li>Clasificación del <i>software</i>
</li>
<li>Sistemas Operativos

</li>
</ol>

</li>
<li>Sistema operativo Linux 
<ol>
<li>Visita guiada
<ol>
<li>Programas pre-instalados
</li>
<li>Configuración
</li>
</ol>

</li>
<li>Línea de comandos
<ol>
<li>Comandos básicos

</li>
</ol>

</li>
</ol>

</li>
<li>Introducción a la programación 
<ol>
<li>¿Qué es programar?
</li>
<li>Lenguajes de programación
<ol>
<li>Paradigmas de programación
</li>
<li>Compiladores e intérpretes
</li>
<li>Ejemplos de lenguajes
</li>
</ol>

</li>
<li>Diseño de algoritmos
</li>
<li>Elementos básicos de un programa
</li>
<li>Ejemplos en clase
</li>
<li>Recursividad

</li>
</ol>

</li>
<li>Programación con el lenguaje Python
<ol>
<li>Terminal interactiva ipython
</li>
<li>Sintaxis básica
</li>
<li>Tipos de datos
</li>
<li>Estructuras de control
</li>
<li>Funciones
</li>
<li>Editor de texto gedit
</li>
<li>Un programa sencillo

</li>
</ol>

</li>
<li>Animaciones con Visual Python

</li>
<li>Cálculo simbólico con MAXIMA
<ol>
<li>Solución de sistemas de ecuaciones
</li>
<li>Derivadas e integrales
</li>
<li>Operaciones con matrices

</li>
</ol>

</li>
<li>Cálculo numérico con Octave
<ol>
<li>Operaciones con vectores y matrices
</li>
<li>Aritmética de punto flotante
</li>
<li>Números aleatorios
</li>
<li>Leer y escribir archivos
</li>
<li>Aplicaciones
<ol>
<li>Solución de ecuaciones diferenciales
</li>
<li>Introducción a los métodos Monte Carlo
</li>
<li>Transformada de Fourier
</li>
</ol>

</li>
<li>Animaciones

</li>
</ol>

</li>
<li>Escritura de documentos con LaTeX
<ol>
<li>Estructura básica de un documento
</li>
<li>Dibujos con Inkscape e ipe
</li>
<li>Insertar gráficas
</li>
<li>Tablas
</li>
<li>Presentaciones con Beamer

</li>
</ol>

</li>
<li>Análisis de datos experimentales con Qtiplot
<ol>
<li>Funciones matemáticas sobre las columnas de datos
</li>
<li>Regresión lineal
</li>
<li>Propagación de incertidumbres

</li>
</ol>

</li>
<li>Análisis de videos con Tracker
</li>
</ol>


</div>

</div>




<div id="outline-container-2" class="outline-4">
<h4 id="sec-2">Referencias</h4>
<div class="outline-text-4" id="text-2">


<ol>
<li>Zelle, J., Python Programming: An Introduction to Computer Science,
   EEUU, Franklin, Beedle and Associates, 2003, 517 p.

</li>
<li>Langtangen, H. P., Python Scripting for Computational Science,
   Springer Verlag, 2008, 758 p. (Acceso gratuito via BiDi)

</li>
<li>Grätzer, G., More math into LaTeX, Springer, 2007, 619 p. (Biblioteca ICN, IM, IIMAS)

</li>
<li>Sección de Recursos en la página del curso
</li>
</ol>

</div>
</div>


  
    <footer>
      
      
    </footer>
  
</article>

</div>

<aside class="sidebar">
  
    <section>
  <h1>Entradas recientes</h1>
  <ul id="recent_posts">
    
      <li class="post">
        <a href="/blog/2012/08/08/feria-de-utiles-escolares-y-computo/">Feria de útiles escolares y cómputo UNAM 2012</a>
      </li>
    
      <li class="post">
        <a href="/blog/2012/08/08/bienvenidos/">Bienvenidos</a>
      </li>
    
  </ul>
</section>






  
</aside>


    </div>
  </div>
  <footer role="contentinfo"><p>
  <a href="http://creativecommons.org/licenses/by-nc-sa/3.0/">CC BY_NC-SA 3.0</a> 2012 - Marduk Bolaños -
  <span class="credit">Producido con <a href="http://octopress.org">Octopress</a></span>
</p>

</footer>
  











</body>
</html>
